GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.h
// Register: RD3PPS
#define RD3PPS RD3PPS
extern volatile unsigned char           RD3PPS              __at(0xE6D);
#ifndef _LIB_BUILD
asm("RD3PPS equ 0E6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD3PPS0                :1;
        unsigned RD3PPS1                :1;
        unsigned RD3PPS2                :1;
        unsigned RD3PPS3                :1;
        unsigned RD3PPS4                :1;
        unsigned RD3PPS5                :1;
    };
} RD3PPSbits_t;
extern volatile RD3PPSbits_t RD3PPSbits __at(0xE6D);
// bitfield macros
#define _RD3PPS_RD3PPS0_POSN                                0x0
#define _RD3PPS_RD3PPS0_POSITION                            0x0
#define _RD3PPS_RD3PPS0_SIZE                                0x1
#define _RD3PPS_RD3PPS0_LENGTH                              0x1
#define _RD3PPS_RD3PPS0_MASK                                0x1
#define _RD3PPS_RD3PPS1_POSN                                0x1
#define _RD3PPS_RD3PPS1_POSITION                            0x1
#define _RD3PPS_RD3PPS1_SIZE                                0x1
#define _RD3PPS_RD3PPS1_LENGTH                              0x1
#define _RD3PPS_RD3PPS1_MASK                                0x2
#define _RD3PPS_RD3PPS2_POSN                                0x2
#define _RD3PPS_RD3PPS2_POSITION                            0x2
#define _RD3PPS_RD3PPS2_SIZE                                0x1
#define _RD3PPS_RD3PPS2_LENGTH                              0x1
#define _RD3PPS_RD3PPS2_MASK                                0x4
#define _RD3PPS_RD3PPS3_POSN                                0x3
#define _RD3PPS_RD3PPS3_POSITION                            0x3
#define _RD3PPS_RD3PPS3_SIZE                                0x1
#define _RD3PPS_RD3PPS3_LENGTH                              0x1
#define _RD3PPS_RD3PPS3_MASK                                0x8
#define _RD3PPS_RD3PPS4_POSN                                0x4
#define _RD3PPS_RD3PPS4_POSITION                            0x4
#define _RD3PPS_RD3PPS4_SIZE                                0x1
#define _RD3PPS_RD3PPS4_LENGTH                              0x1
#define _RD3PPS_RD3PPS4_MASK                                0x10
#define _RD3PPS_RD3PPS5_POSN                                0x5
#define _RD3PPS_RD3PPS5_POSITION                            0x5
#define _RD3PPS_RD3PPS5_SIZE                                0x1
#define _RD3PPS_RD3PPS5_LENGTH                              0x1
#define _RD3PPS_RD3PPS5_MASK                                0x20

// Register: RD4PPS
#define RD4PPS RD4PPS
extern volatile unsigned char           RD4PPS              __at(0xE6E);
#ifndef _LIB_BUILD
asm("RD4PPS equ 0E6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD4PPS0                :1;
        unsigned RD4PPS1                :1;
        unsigned RD4PPS2                :1;
        unsigned RD4PPS3                :1;
        unsigned RD4PPS4                :1;
        unsigned RD4PPS5                :1;
    };
} RD4PPSbits_t;
extern volatile RD4PPSbits_t RD4PPSbits __at(0xE6E);
// bitfield macros
#define _RD4PPS_RD4PPS0_POSN                                0x0
#define _RD4PPS_RD4PPS0_POSITION                            0x0
#define _RD4PPS_RD4PPS0_SIZE                                0x1
#define _RD4PPS_RD4PPS0_LENGTH                              0x1
#define _RD4PPS_RD4PPS0_MASK                                0x1
#define _RD4PPS_RD4PPS1_POSN                                0x1
#define _RD4PPS_RD4PPS1_POSITION                            0x1
#define _RD4PPS_RD4PPS1_SIZE                                0x1
#define _RD4PPS_RD4PPS1_LENGTH                              0x1
#define _RD4PPS_RD4PPS1_MASK                                0x2
#define _RD4PPS_RD4PPS2_POSN                                0x2
#define _RD4PPS_RD4PPS2_POSITION                            0x2
#define _RD4PPS_RD4PPS2_SIZE                                0x1
#define _RD4PPS_RD4PPS2_LENGTH                              0x1
#define _RD4PPS_RD4PPS2_MASK                                0x4
#define _RD4PPS_RD4PPS3_POSN                                0x3
#define _RD4PPS_RD4PPS3_POSITION                            0x3
#define _RD4PPS_RD4PPS3_SIZE                                0x1
#define _RD4PPS_RD4PPS3_LENGTH                              0x1
#define _RD4PPS_RD4PPS3_MASK                                0x8
#define _RD4PPS_RD4PPS4_POSN                                0x4
#define _RD4PPS_RD4PPS4_POSITION                            0x4
#define _RD4PPS_RD4PPS4_SIZE                                0x1
#define _RD4PPS_RD4PPS4_LENGTH                              0x1
#define _RD4PPS_RD4PPS4_MASK                                0x10
#define _RD4PPS_RD4PPS5_POSN                                0x5
#define _RD4PPS_RD4PPS5_POSITION                            0x5
#define _RD4PPS_RD4PPS5_SIZE                                0x1
#define _RD4PPS_RD4PPS5_LENGTH                              0x1
#define _RD4PPS_RD4PPS5_MASK                                0x20

// Register: RD5PPS
#define RD5PPS RD5PPS
extern volatile unsigned char           RD5PPS              __at(0xE6F);
#ifndef _LIB_BUILD
asm("RD5PPS equ 0E6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD5PPS0                :1;
        unsigned RD5PPS1                :1;
        unsigned RD5PPS2                :1;
        unsigned RD5PPS3                :1;
        unsigned RD5PPS4                :1;
        unsigned RD5PPS5                :1;
    };
} RD5PPSbits_t;
extern volatile RD5PPSbits_t RD5PPSbits __at(0xE6F);
// bitfield macros
#define _RD5PPS_RD5PPS0_POSN                                0x0
#define _RD5PPS_RD5PPS0_POSITION                            0x0
#define _RD5PPS_RD5PPS0_SIZE                                0x1
#define _RD5PPS_RD5PPS0_LENGTH                              0x1
#define _RD5PPS_RD5PPS0_MASK                                0x1
#define _RD5PPS_RD5PPS1_POSN                                0x1
#define _RD5PPS_RD5PPS1_POSITION                            0x1
#define _RD5PPS_RD5PPS1_SIZE                                0x1
#define _RD5PPS_RD5PPS1_LENGTH                              0x1
#define _RD5PPS_RD5PPS1_MASK                                0x2
#define _RD5PPS_RD5PPS2_POSN                                0x2
#define _RD5PPS_RD5PPS2_POSITION                            0x2
#define _RD5PPS_RD5PPS2_SIZE                                0x1
#define _RD5PPS_RD5PPS2_LENGTH                              0x1
#define _RD5PPS_RD5PPS2_MASK                                0x4
#define _RD5PPS_RD5PPS3_POSN                                0x3
#define _RD5PPS_RD5PPS3_POSITION                            0x3
#define _RD5PPS_RD5PPS3_SIZE                                0x1
#define _RD5PPS_RD5PPS3_LENGTH                              0x1
#define _RD5PPS_RD5PPS3_MASK                                0x8
#define _RD5PPS_RD5PPS4_POSN                                0x4
#define _RD5PPS_RD5PPS4_POSITION                            0x4
#define _RD5PPS_RD5PPS4_SIZE                                0x1
#define _RD5PPS_RD5PPS4_LENGTH                              0x1
#define _RD5PPS_RD5PPS4_MASK                                0x10
#define _RD5PPS_RD5PPS5_POSN                                0x5
#define _RD5PPS_RD5PPS5_POSITION                            0x5
#define _RD5PPS_RD5PPS5_SIZE                                0x1
#define _RD5PPS_RD5PPS5_LENGTH                              0x1
#define _RD5PPS_RD5PPS5_MASK                                0x20

// Register: RD6PPS
#define RD6PPS RD6PPS
extern volatile unsigned char           RD6PPS              __at(0xE70);
#ifndef _LIB_BUILD
asm("RD6PPS equ 0E70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD6PPS0                :1;
        unsigned RD6PPS1                :1;
        unsigned RD6PPS2                :1;
        unsigned RD6PPS3                :1;
        unsigned RD6PPS4                :1;
        unsigned RD6PPS5                :1;
    };
} RD6PPSbits_t;
