GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.h
// Register: RH2PPS
#define RH2PPS RH2PPS
extern volatile unsigned char           RH2PPS              __at(0xE8C);
#ifndef _LIB_BUILD
asm("RH2PPS equ 0E8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH2PPS0                :1;
        unsigned RH2PPS1                :1;
        unsigned RH2PPS2                :1;
        unsigned RH2PPS3                :1;
        unsigned RH2PPS4                :1;
        unsigned RH2PPS5                :1;
    };
} RH2PPSbits_t;
extern volatile RH2PPSbits_t RH2PPSbits __at(0xE8C);
// bitfield macros
#define _RH2PPS_RH2PPS0_POSN                                0x0
#define _RH2PPS_RH2PPS0_POSITION                            0x0
#define _RH2PPS_RH2PPS0_SIZE                                0x1
#define _RH2PPS_RH2PPS0_LENGTH                              0x1
#define _RH2PPS_RH2PPS0_MASK                                0x1
#define _RH2PPS_RH2PPS1_POSN                                0x1
#define _RH2PPS_RH2PPS1_POSITION                            0x1
#define _RH2PPS_RH2PPS1_SIZE                                0x1
#define _RH2PPS_RH2PPS1_LENGTH                              0x1
#define _RH2PPS_RH2PPS1_MASK                                0x2
#define _RH2PPS_RH2PPS2_POSN                                0x2
#define _RH2PPS_RH2PPS2_POSITION                            0x2
#define _RH2PPS_RH2PPS2_SIZE                                0x1
#define _RH2PPS_RH2PPS2_LENGTH                              0x1
#define _RH2PPS_RH2PPS2_MASK                                0x4
#define _RH2PPS_RH2PPS3_POSN                                0x3
#define _RH2PPS_RH2PPS3_POSITION                            0x3
#define _RH2PPS_RH2PPS3_SIZE                                0x1
#define _RH2PPS_RH2PPS3_LENGTH                              0x1
#define _RH2PPS_RH2PPS3_MASK                                0x8
#define _RH2PPS_RH2PPS4_POSN                                0x4
#define _RH2PPS_RH2PPS4_POSITION                            0x4
#define _RH2PPS_RH2PPS4_SIZE                                0x1
#define _RH2PPS_RH2PPS4_LENGTH                              0x1
#define _RH2PPS_RH2PPS4_MASK                                0x10
#define _RH2PPS_RH2PPS5_POSN                                0x5
#define _RH2PPS_RH2PPS5_POSITION                            0x5
#define _RH2PPS_RH2PPS5_SIZE                                0x1
#define _RH2PPS_RH2PPS5_LENGTH                              0x1
#define _RH2PPS_RH2PPS5_MASK                                0x20

// Register: RH3PPS
#define RH3PPS RH3PPS
extern volatile unsigned char           RH3PPS              __at(0xE8D);
#ifndef _LIB_BUILD
asm("RH3PPS equ 0E8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH3PPS0                :1;
        unsigned RH3PPS1                :1;
        unsigned RH3PPS2                :1;
        unsigned RH3PPS3                :1;
        unsigned RH3PPS4                :1;
        unsigned RH3PPS5                :1;
    };
} RH3PPSbits_t;
extern volatile RH3PPSbits_t RH3PPSbits __at(0xE8D);
// bitfield macros
#define _RH3PPS_RH3PPS0_POSN                                0x0
#define _RH3PPS_RH3PPS0_POSITION                            0x0
#define _RH3PPS_RH3PPS0_SIZE                                0x1
#define _RH3PPS_RH3PPS0_LENGTH                              0x1
#define _RH3PPS_RH3PPS0_MASK                                0x1
#define _RH3PPS_RH3PPS1_POSN                                0x1
#define _RH3PPS_RH3PPS1_POSITION                            0x1
#define _RH3PPS_RH3PPS1_SIZE                                0x1
#define _RH3PPS_RH3PPS1_LENGTH                              0x1
#define _RH3PPS_RH3PPS1_MASK                                0x2
#define _RH3PPS_RH3PPS2_POSN                                0x2
#define _RH3PPS_RH3PPS2_POSITION                            0x2
#define _RH3PPS_RH3PPS2_SIZE                                0x1
#define _RH3PPS_RH3PPS2_LENGTH                              0x1
#define _RH3PPS_RH3PPS2_MASK                                0x4
#define _RH3PPS_RH3PPS3_POSN                                0x3
#define _RH3PPS_RH3PPS3_POSITION                            0x3
#define _RH3PPS_RH3PPS3_SIZE                                0x1
#define _RH3PPS_RH3PPS3_LENGTH                              0x1
#define _RH3PPS_RH3PPS3_MASK                                0x8
#define _RH3PPS_RH3PPS4_POSN                                0x4
#define _RH3PPS_RH3PPS4_POSITION                            0x4
#define _RH3PPS_RH3PPS4_SIZE                                0x1
#define _RH3PPS_RH3PPS4_LENGTH                              0x1
#define _RH3PPS_RH3PPS4_MASK                                0x10
#define _RH3PPS_RH3PPS5_POSN                                0x5
#define _RH3PPS_RH3PPS5_POSITION                            0x5
#define _RH3PPS_RH3PPS5_SIZE                                0x1
#define _RH3PPS_RH3PPS5_LENGTH                              0x1
#define _RH3PPS_RH3PPS5_MASK                                0x20

// Register: INLVLA
#define INLVLA INLVLA
extern volatile unsigned char           INLVLA              __at(0xE8E);
#ifndef _LIB_BUILD
asm("INLVLA equ 0E8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLA0                :1;
        unsigned INLVLA1                :1;
        unsigned INLVLA2                :1;
        unsigned INLVLA3                :1;
        unsigned INLVLA4                :1;
        unsigned INLVLA5                :1;
        unsigned INLVLA6                :1;
        unsigned INLVLA7                :1;
    };
} INLVLAbits_t;
extern volatile INLVLAbits_t INLVLAbits __at(0xE8E);
// bitfield macros
#define _INLVLA_INLVLA0_POSN                                0x0
#define _INLVLA_INLVLA0_POSITION                            0x0
#define _INLVLA_INLVLA0_SIZE                                0x1
#define _INLVLA_INLVLA0_LENGTH                              0x1
#define _INLVLA_INLVLA0_MASK                                0x1
#define _INLVLA_INLVLA1_POSN                                0x1
#define _INLVLA_INLVLA1_POSITION                            0x1
#define _INLVLA_INLVLA1_SIZE                                0x1
#define _INLVLA_INLVLA1_LENGTH                              0x1
#define _INLVLA_INLVLA1_MASK                                0x2
#define _INLVLA_INLVLA2_POSN                                0x2
#define _INLVLA_INLVLA2_POSITION                            0x2
#define _INLVLA_INLVLA2_SIZE                                0x1
#define _INLVLA_INLVLA2_LENGTH                              0x1
#define _INLVLA_INLVLA2_MASK                                0x4
#define _INLVLA_INLVLA3_POSN                                0x3
#define _INLVLA_INLVLA3_POSITION                            0x3
#define _INLVLA_INLVLA3_SIZE                                0x1
#define _INLVLA_INLVLA3_LENGTH                              0x1
#define _INLVLA_INLVLA3_MASK                                0x8
#define _INLVLA_INLVLA4_POSN                                0x4
#define _INLVLA_INLVLA4_POSITION                            0x4
#define _INLVLA_INLVLA4_SIZE                                0x1
#define _INLVLA_INLVLA4_LENGTH                              0x1
#define _INLVLA_INLVLA4_MASK                                0x10
#define _INLVLA_INLVLA5_POSN                                0x5
#define _INLVLA_INLVLA5_POSITION                            0x5
#define _INLVLA_INLVLA5_SIZE                                0x1
#define _INLVLA_INLVLA5_LENGTH                              0x1
#define _INLVLA_INLVLA5_MASK                                0x20
#define _INLVLA_INLVLA6_POSN                                0x6
#define _INLVLA_INLVLA6_POSITION                            0x6
#define _INLVLA_INLVLA6_SIZE                                0x1
#define _INLVLA_INLVLA6_LENGTH                              0x1
#define _INLVLA_INLVLA6_MASK                                0x40
#define _INLVLA_INLVLA7_POSN                                0x7
#define _INLVLA_INLVLA7_POSITION                            0x7
#define _INLVLA_INLVLA7_SIZE                                0x1
#define _INLVLA_INLVLA7_LENGTH                              0x1
#define _INLVLA_INLVLA7_MASK                                0x80

// Register: SLRCONA
#define SLRCONA SLRCONA
extern volatile unsigned char           SLRCONA             __at(0xE8F);
#ifndef _LIB_BUILD
asm("SLRCONA equ 0E8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRA0                  :1;
        unsigned SLRA1                  :1;
        unsigned SLRA2                  :1;
        unsigned SLRA3                  :1;
        unsigned SLRA4                  :1;
        unsigned SLRA5                  :1;
        unsigned SLRA6                  :1;
        unsigned SLRA7                  :1;
    };
} SLRCONAbits_t;
extern volatile SLRCONAbits_t SLRCONAbits __at(0xE8F);
// bitfield macros
#define _SLRCONA_SLRA0_POSN                                 0x0
#define _SLRCONA_SLRA0_POSITION                             0x0
#define _SLRCONA_SLRA0_SIZE                                 0x1
#define _SLRCONA_SLRA0_LENGTH                               0x1
#define _SLRCONA_SLRA0_MASK                                 0x1
#define _SLRCONA_SLRA1_POSN                                 0x1
#define _SLRCONA_SLRA1_POSITION                             0x1
#define _SLRCONA_SLRA1_SIZE                                 0x1
#define _SLRCONA_SLRA1_LENGTH                               0x1
#define _SLRCONA_SLRA1_MASK                                 0x2
#define _SLRCONA_SLRA2_POSN                                 0x2
#define _SLRCONA_SLRA2_POSITION                             0x2
#define _SLRCONA_SLRA2_SIZE                                 0x1
#define _SLRCONA_SLRA2_LENGTH                               0x1
#define _SLRCONA_SLRA2_MASK                                 0x4
#define _SLRCONA_SLRA3_POSN                                 0x3
#define _SLRCONA_SLRA3_POSITION                             0x3
#define _SLRCONA_SLRA3_SIZE                                 0x1
#define _SLRCONA_SLRA3_LENGTH                               0x1
#define _SLRCONA_SLRA3_MASK                                 0x8
#define _SLRCONA_SLRA4_POSN                                 0x4
#define _SLRCONA_SLRA4_POSITION                             0x4
#define _SLRCONA_SLRA4_SIZE                                 0x1
#define _SLRCONA_SLRA4_LENGTH                               0x1
#define _SLRCONA_SLRA4_MASK                                 0x10
#define _SLRCONA_SLRA5_POSN                                 0x5
#define _SLRCONA_SLRA5_POSITION                             0x5
#define _SLRCONA_SLRA5_SIZE                                 0x1
#define _SLRCONA_SLRA5_LENGTH                               0x1
#define _SLRCONA_SLRA5_MASK                                 0x20
#define _SLRCONA_SLRA6_POSN                                 0x6
#define _SLRCONA_SLRA6_POSITION                             0x6
#define _SLRCONA_SLRA6_SIZE                                 0x1
#define _SLRCONA_SLRA6_LENGTH                               0x1
#define _SLRCONA_SLRA6_MASK                                 0x40
#define _SLRCONA_SLRA7_POSN                                 0x7
#define _SLRCONA_SLRA7_POSITION                             0x7
#define _SLRCONA_SLRA7_SIZE                                 0x1
#define _SLRCONA_SLRA7_LENGTH                               0x1
#define _SLRCONA_SLRA7_MASK                                 0x80

// Register: ODCONA
#define ODCONA ODCONA
extern volatile unsigned char           ODCONA              __at(0xE90);
#ifndef _LIB_BUILD
asm("ODCONA equ 0E90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCA0                  :1;
        unsigned ODCA1                  :1;
        unsigned ODCA2                  :1;
        unsigned ODCA3                  :1;
        unsigned ODCA4                  :1;
        unsigned ODCA5                  :1;
        unsigned ODCA6                  :1;
        unsigned ODCA7                  :1;
    };
} ODCONAbits_t;
